import random



def getweirdfont(char=""):
	pass

	# 𝔮𝔴𝔢𝔯𝔱𝔶𝔲𝔦𝔬𝔭𝔞𝔰𝔡𝔣𝔤𝔥𝔧𝔨𝔩𝔷𝔵𝔠𝔳𝔅𝔫𝔪

	medieval = {
		"q": "𝔮",
		"w": "𝔴",
		"e": "𝔢",
		"r": "𝔯",
		"t": "𝔱",
		"y": "𝔶",
		"u": "𝔲",
		"i": "𝔦",
		"o": "𝔬",
		"p": "𝔭",
		"a": "𝔞",
		"s": "𝔰",
		"d": "𝔡",
		"f": "𝔣",
		"g": "𝔤",
		"h": "𝔥",
		"j": "𝔧",
		"k": "k",
		"l": "𝔨",
		"z": "𝔷",
		"x": "𝔵",
		"c": "𝔠",
		"v": "v",
		"b": "𝔅",
		"n": "𝔫",
		"m": "𝔪",
	}

	# 𝕢𝕨𝕖𝕣𝕥𝕪𝕦𝕚𝕠𝕡𝕒𝕤𝕕𝕗𝕘𝕙𝕛𝕜𝕝𝕫𝕩𝕧𝕓𝕟𝕞

	lined = {
		"q": "𝕢",
		"w": "𝕨",
		"e": "𝕖",
		"r": "𝕣",
		"t": "𝕥",
		"y": "𝕪",
		"u": "𝕦",
		"i": "𝕚",
		"o": "𝕠",
		"p": "𝕡",
		"a": "𝕒",
		"s": "𝕤",
		"d": "𝕕",
		"f": "𝕗",
		"g": "𝕘",
		"h": "𝕙",
		"j": "𝕛",
		"k": "𝕜",
		"l": "𝕝",
		"z": "𝕫",
		"x": "𝕩",
		"c": "𝕔",
		"v": "𝕧",
		"b": "𝕓",
		"n": "𝕟",
		"m": "𝕞",
	}

	# 𝓺𝔀𝓮𝓻𝓽𝔂𝓾𝓲𝓸𝓹𝓪𝓼𝓭𝓯𝓰𝓱𝓳𝓴𝓵𝔃𝔁𝓬𝓿𝓫𝓷𝓶

	fancy = {
		"q": "𝓺",
		"w": "𝔀",
		"e": "𝓮",
		"r": "𝓻",
		"t": "𝓽",
		"y": "𝔂",
		"u": "𝓾",
		"i": "𝓲",
		"o": "𝓹",
		"p": "𝕡",
		"a": "𝓪",
		"s": "𝓼",
		"d": "𝓭",
		"f": "𝓯",
		"g": "𝓰",
		"h": "𝓱",
		"j": "𝓳",
		"k": "𝓴",
		"l": "𝓵",
		"z": "𝔃",
		"x": "𝔁",
		"c": "𝓬",
		"v": "𝓿",
		"b": "𝓫",
		"n": "𝓷",
		"m": "𝓶",
	}

	if char != "":
		pass

		chartoreturn = ""

		if char != "1" or "2" or "3" or "4" or "5" or "6" or "7" or "8" or "9" or "0" "." or "," or "'" or '"' or "!" or "?" or "[" or "]" or "~" or "`" or "#":
			pass

			font = ""

			if random.randint(1, 2) == 2:
				pass

				rng = random.randint(1, 3)

				if rng == 1:
					pass

					font = medieval
				elif rng == 2:
					pass

					font = lined
				elif rng == 3:
					pass

					font = fancy

				try:
					pass

					chartoreturn = font[char]
				except:
					pass

					chartoreturn = char
			else:
				pass

				chartoreturn = char

			return chartoreturn
		else:
			pass

			chartoreturn = char

			return chartoreturn